InformationRegisters/ГраницыКонтролируемостиСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ГраницыКонтролируемостиСделок</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредельнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсобенностьОтнесенияСделкиККонтролируемой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиОтнесенияСделокККонтролируемым</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОсобенностиОтнесенияСделокККонтролируемым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ОсобенностиОтнесенияСделокККонтролируемым</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛицаПлательщикиНДПИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛицаНаСпецрежимах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛицаОсобаяЭкономическаяЗона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МинимальнаяСуммаДляВключенияВУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезависимыеИностранныеЛица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ГраницыКонтролируемостиСделок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Метод заполняет данные регистра значениями по умолчанию
//		
Процедура ЗаполнитьГраницыКонтролируемости() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
	
		Записи = РегистрыСведений.ГраницыКонтролируемостиСделок.СоздатьНаборЗаписей();
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Записи);
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20120101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица;
		Запись.ПредельнаяСумма = 3000000000;

		Запись = Записи.Добавить();
		Запись.Период = Дата('20130101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица;
		Запись.ПредельнаяСумма = 2000000000;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20140101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица;
		Запись.ПредельнаяСумма = 1000000000;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20120101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаНаСпецрежимах;
		Запись.ПредельнаяСумма = 100000000;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20120101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона;
		Запись.ПредельнаяСумма = 999999999999999;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20140101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона;
		Запись.ПредельнаяСумма = 60000000;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20120101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль;
		Запись.ПредельнаяСумма = 60000000;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20120101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНДПИ;
		Запись.ПредельнаяСумма = 60000000;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20120101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление;
		Запись.ПредельнаяСумма = 100000000;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20130101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление;
		Запись.ПредельнаяСумма = 80000000;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20140101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление;
		Запись.ПредельнаяСумма = 0;
		
		Запись = Записи.Добавить();
		Запись.Период = Дата('20120101');
		Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.НезависимыеИностранныеЛица;
		Запись.ПредельнаяСумма = 60000000;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Записи);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось заполнить данными регистр ""Границы контролируемости сделок"", по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
								УровеньЖурналаРегистрации.Предупреждение,
								Метаданные.РегистрыСведений.ГраницыКонтролируемостиСделок,
								,
								ТекстСообщения);
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
